# STATISTICAL TESTS-ASSIGNMENT

#### 1. A physician is evaluating a new diet for her patients with a family history of heart disease. To test the effectiveness of this, 16 patients are placed on the diet for 6 months. Their weights and triglyceride levels are measured before and after the study, and the physician wants to know if either set of measurements has changed.

In [29]:
import numpy as np
import pandas as pd
import scipy.stats as stats

In [30]:
Diet=pd.read_csv('dietstudy.csv')

In [31]:
Diet

    patid  age  gender  tg0  tg1  tg2  tg3  tg4  wgt0  wgt1  wgt2  wgt3  wgt4
0       1   45    Male  180  148  106  113  100   198   196   193   188   192
1       2   56    Male  139   94  119   75   92   237   233   232   228   225
2       3   50    Male  152  185   86  149  118   233   231   229   228   226
3       4   46  Female  112  145  136  149   82   179   181   177   174   172
4       5   64    Male  156  104  157   79   97   219   217   215   213   214
5       6   49  Female  167  138   88  107  171   169   166   165   162   161
6       7   63    Male  138  132  146  143  132   222   219   215   215   210
7       8   63  Female  160  128  150  118  123   167   167   166   162   161
8       9   52    Male  107  120  129  195  174   199   200   196   196   193
9      10   45    Male  156  103  126  135   92   233   229   229   229   226
10     11   61  Female   94  144  114  114  121   179   181   176   173   173
11     12   49  Female  107   93  156  148  150   158   153   155   155   154
12     13   61  Female  145  107  129   86  159   157   151   150   145   143
13     14   59    Male  186  142  128  122  101   216   213   210   210   206
14     15   52    Male  112  107  103   89  148   257   255   254   252   249
15     16   60  Female  104  103  117   79  130   151   146   144   144   140

In [32]:
print(Diet.tg0.mean())
print(Diet.tg4.mean())
print(Diet.wgt0.mean())
print(Diet.wgt4.mean())

138.4375
124.375
198.375
190.3125

## Two Sample T-Test (Paired)

In [33]:
#stats.ttest_rel(a = before, b = after)
stats.ttest_rel(a = Diet.tg0,
                b = Diet.tg4)

Ttest_relResult(statistic=1.2000008533342437, pvalue=0.24874946576903698)

In [34]:
stats.ttest_rel(a=Diet.wgt0,
                b=Diet.wgt4)

Ttest_relResult(statistic=11.174521688532522, pvalue=1.137689414996614e-08)

In [35]:
#### p is low null is H0 is rejected Ha is card usage is increased we accept Ha More than 99% we confident

#### 2. An analyst at a department store wants to evaluate a recent credit cardpromotion. To this end, 500 cardholders were randomly selected. Half received an ad promoting a reduced interest rate on purchases made over the next three months, and half received a standard seasonal ad. Is the promotion effective to increase sales?

In [44]:
Cardholder=pd.read_csv('creditpromo.csv')
Cardholder

         id         insert      dollars
0       148       Standard  2232.771979
1       572  New Promotion  1403.807542
2       973       Standard  2327.092181
3      1096       Standard  1280.030541
4      1541  New Promotion  1513.563200
..      ...            ...          ...
495  130163  New Promotion  1513.060134
496  130204  New Promotion  1020.757943
497  130255       Standard  1919.856304
498  130583       Standard  1863.014814
499  130682       Standard  1295.012183

[500 rows x 3 columns]

In [45]:
Cardholder.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       500 non-null    int64
 1   insert   500 non-null    object
 2   dollars  500 non-null    float64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.8+ KB

In [47]:
Cardholder.replace('New Promotion','New_Promotion' , inplace=True)

In [48]:
card_holder=pd.get_dummies(Cardholder, columns=['insert'])

In [58]:
card_holder

         id      dollars  insert_New_Promotion  insert_Standard
0       148  2232.771979                     0                1
1       572  1403.807542                     1                0
2       973  2327.092181                     0                1
3      1096  1280.030541                     0                1
4      1541  1513.563200                     1                0
..      ...          ...                   ...              ...
495  130163  1513.060134                     1                0
496  130204  1020.757943                     1                0
497  130255  1919.856304                     0                1
498  130583  1863.014814                     0                1
499  130682  1295.012183                     0                1

[500 rows x 4 columns]

In [40]:
card_holder.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 4 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   id                    500 non-null    int64
 1   dollars               500 non-null    float64
 2   insert_New Promotion  500 non-null    uint8
 3   insert_Standard       500 non-null    uint8
dtypes: float64(1), int64(1), uint8(2)
memory usage: 8.9 KB

In [50]:
New_promotion = card_holder.dollars[card_holder.insert_New_Promotion]
Standard = card_holder.dollars[card_holder.insert_Standard]

In [51]:
print(New_promotion.mean())
print(Standard.mean())

1818.2897602276535
1818.289760227652

In [53]:
print(New_promotion.var())
print(Standard.var())

172139.78892472506
172139.78892472544

In [54]:
stats.ttest_ind(a = New_promotion,
                b = Standard)

Ttest_indResult(statistic=0.0, pvalue=1.0)

In [55]:
stats.f_oneway(New_promotion, Standard)

F_onewayResult(statistic=-1.1514662328864309e-29, pvalue=nan)

#### 3. An experiment is conducted to study the hybrid seed production of bottle gourd under open field conditions. The main aim of the investigation is to compare natural pollination and hand pollination. The data are collected on 10 randomly selected plants from each of natural pollination and hand pollination. The data are collected on fruit weight (kg), seed yield/plant (g) and seedling length (cm).

In [61]:
pollination=pd.read_csv('pollination.csv')
pollination.head(10)

     Group  Fruit_Wt  Seed_Yield_Plant  Seedling_length
0  Natural      1.85            147.70            16.86
1  Natural      1.86            136.86            16.77
2  Natural      1.83            149.97            16.35
3  Natural      1.89            172.33            18.26
4  Natural      1.80            144.46            17.90
5  Natural      1.88            138.30            16.95
6  Natural      1.89            150.58            18.15
7  Natural      1.79            140.99            18.86
8  Natural      1.85            140.57            18.39
9  Natural      1.84            138.33            18.58

In [62]:
pollination.tail(2)

   Group  Fruit_Wt  Seed_Yield_Plant  Seedling_length
18  Hand      2.45            199.87            19.31
19  Hand      2.44            214.30            19.36

##### a. Is the overall population of Seed yield/plant (g) equals to 200?

In [78]:
pollination.Seed_Yield_Plant.mean()

180.8035

 ##### Test whether the natural pollination and hand pollination under open field conditions are equally effective or are significantly different.

In [75]:
poll_hand=pollination[pollination.Group=='Hand'].mean()
poll_hand

Fruit_Wt              2.566
Seed_Yield_Plant    215.598
Seedling_length      18.590
dtype: float64

In [73]:
poll_natural=pollination[pollination.Group=='Natural'].mean()
poll_hand

Fruit_Wt              1.848
Seed_Yield_Plant    146.009
Seedling_length      17.707
dtype: float64

In [77]:
stats.f_oneway(poll_natural, poll_hand)

F_onewayResult(statistic=0.08311843626434934, pvalue=0.7874373341797553)

In [79]:
stats.ttest_ind(poll_natural, poll_hand)

Ttest_indResult(statistic=-0.28830268168081497, pvalue=0.787437334179756)

#### 4. An electronics firm is developing a new DVD player in response to customer requests. Using a prototype, the marketing team has collected focus data for different age groups viz. Under 25; 25-34; 35-44; 45-54; 55-64; 65 and above. Do you think that consumers of various ages rated the design differently?

In [86]:
dvd_design=pd.read_csv('dvdplayer.csv')
dvd_design.head(2)

      agegroup   dvdscore
0  65 and over  38.454803
1        55-64  17.669677

In [87]:
dvd_design.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 68 entries, 0 to 67
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   agegroup  68 non-null     object
 1   dvdscore  68 non-null     float64
dtypes: float64(1), object(1)
memory usage: 1.2+ KB

In [97]:
age1=dvd_design.dvdscore[dvd_design.agegroup=='under 25']
age2=dvd_design.dvdscore[dvd_design.agegroup=='25-34']
age3=dvd_design.dvdscore[dvd_design.agegroup=='35-44']
age4=dvd_design.dvdscore[dvd_design.agegroup=='45-54']
age5=dvd_design.dvdscore[dvd_design.agegroup=='55-64']
age6=dvd_design.dvdscore[dvd_design.agegroup=='65 and above']

In [98]:
stats.f_oneway(age1,age2,age3,age4,age5,age6)

C:\Users\Sarita\anaconda3\lib\site-packages\scipy\stats\stats.py:3339: RuntimeWarning: invalid value encountered in double_scalars
  ssbn += _square_of_sums(a - offset) / len(a)

F_onewayResult(statistic=nan, pvalue=nan)

#### 5. A survey was conducted among 2800 customers on several demographic characteristics. Working status, sex, age, age-group, race, happiness, no. of child, marital status, educational qualifications, income group etc. had been captured for that purpose.

In [99]:
demog=pd.read_csv('sample_survey.csv')
demog.head(2)

,id,wrkstat,marital,childs,age,educ,paeduc,maeduc,speduc,degree,...,agecat,childcat,news1,news2,news3,news4,news5,car1,car2,car3
0,1,Working full time,Divorced,2.0,60.0,12.0,12.0,12.0,NaN,High school,...,55 to 64,1-2,No,No,No,No,No,American,Japanese,Japanese
1,2,Working part-time,Never married,0.0,27.0,17.0,20.0,NaN,NaN,Junior college,...,25 to 34,None,No,No,Yes,No,No,American,German,Japanese

In [100]:
demog.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2832 entries, 0 to 2831
Data columns (total 46 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        2832 non-null   int64
 1   wrkstat   2831 non-null   object
 2   marital   2831 non-null   object
 3   childs    2825 non-null   float64
 4   age       2828 non-null   float64
 5   educ      2820 non-null   float64
 6   paeduc    2041 non-null   float64
 7   maeduc    2399 non-null   float64
 8   speduc    1311 non-null   float64
 9   degree    2822 non-null   object
 10  sex       2832 non-null   object
 11  race      2832 non-null   object
 12  born      2819 non-null   object
 13  parborn   2812 non-null   object
 14  granborn  2630 non-null   float64
 15  income    2503 non-null   object
 16  rincome   1849 non-null   object
 17  polviews  2691 non-null   object
 18  cappun    2599 non-null   object
 19  postlife  2066 non-null   object
 20  happy     2806 non-null   object
 21  hapmar    1337 non-null   object
 22  owngun    1869 non-null   object
 23  news      1870 non-null   object
 24  tvhours   2337 non-null   float64
 25  howpaid   1347 non-null   object
 26  ethnic    2238 non-null   object
 27  eth1      2557 non-null   object
 28  eth2      1102 non-null   object
 29  eth3      444 non-null    object
 30  confinan  1864 non-null   object
 31  conbus    1821 non-null   object
 32  coneduc   1881 non-null   object
 33  conpress  1862 non-null   object
 34  conmedic  1875 non-null   object
 35  contv     1876 non-null   object
 36  agecat    2828 non-null   object
 37  childcat  2825 non-null   object
 38  news1     2832 non-null   object
 39  news2     2832 non-null   object
 40  news3     2832 non-null   object
 41  news4     2832 non-null   object
 42  news5     2832 non-null   object
 43  car1      2832 non-null   object
 44  car2      2266 non-null   object
 45  car3      1672 non-null   object
dtypes: float64(8), int64(1), object(37)
memory usage: 1017.9+ KB

In [103]:
demog.frq = pd.crosstab(demog.income, demog.marital)

C:\Users\Sarita\anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  """Entry point for launching an IPython kernel.

##### a. Is there any relationship in between labour force status with marital status?

In [102]:
stats.pearsonr(demog['marital'],demog.income)

TypeError: unsupported operand type(s) for +: 'float' and 'str'

##### b. Do you think educational qualification is somehow controlling the marital status?

##### c. Is happiness is driven by earnings or marital status?